multiRegionHeater/system/passive/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// boundary
// {
//     inlet
//     {
//         type            patch;
//         inGroups        (coupleGroup);
//     }
//     wall
//     {
//         type            wall;
//     }
//     outlet
//     {
//         type            patch;
//     }
// }

T
{
    internalField   uniform 300;

    boundaryField
    {
        "inlet|outlet|top"
        {
            type            zeroGradient;
            value           uniform 300;
        }
        "passive_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }
        "front|back"
        {
            type            empty;
        }
    }
}


// ************************************************************************* //
